# running in sram/src/
read_verilog -formal -sv sram_formal_bmc.v
prep -top sram_formal_bmc

hierarchy -smtcheck
rename -witness
write_jny -no-connections ../model/design.json
write_rtlil ../model/design.il
