# running in sys_ctrl/src/
read_verilog -formal -sv sys_ctrl.v
read_verilog -formal -sv ef_util_lib.v
prep -top sys_ctrl

hierarchy -smtcheck
rename -witness
write_jny -no-connections ../model/design.json
write_rtlil ../model/design.il
